In [13]:
#Series Class
# Numpy 1차원 배열 + 데이터의 의미를 표시하는 인덱스
# DataFrame의 하나의 열

#Series 생성
import pandas as pd
import numpy as np
s = pd.Series([9904312, 3448737, 2890451, 2466052],
index=["서울", "부산", "인천", "대구"])
#Series 인덱싱
s[1], s["부산"] # Single value 값 하나 인덱스
s[[0, 3, 1]] #   Series        값 여러개 인덱스
# 아래와 같이 사용하면 에러
#s["서울","부산"]

#Series 연산
s / 1000000

서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
dtype: float64

In [ ]:
# 시리즈 데이터는 넘파이 어레이 이므로 수식을 바로 적용가능
dice=pd.Series(np.random.randint(1,7,10))
dice*10

In [42]:
# 시리즈와 딕셔너리

city={"서울":9642314,"부산":339152,"인천":2612332}
metro2=pd.Series(city)
metro2

서울    9642314
부산     339152
인천    2612332
dtype: int64

In [20]:
s-metro2

대구           NaN
부산     3109585.0
서 울          NaN
서울           NaN
인천      278119.0
dtype: float64

In [23]:
#무한대 , 결측치 ->실수 (numpy)
a=np.array([np.inf,np.nan,0,1,2])
a

array([inf, nan,  0.,  1.,  2.])

In [26]:
#속성
s.values
s.index
s.name="도시"
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 도시, dtype: int64

In [30]:
# Method
dice.count() #element의 갯수
dice.unique() # 고유한 값
dice.nunique() #고유한 값의 갯수

5

In [31]:
#고유한 값별로 갯수
dice.value_counts()

4    3
3    3
2    2
5    1
6    1
dtype: int64

In [32]:
dice.sum(),dice.min(),dice.max(),dice.mean()

(36, 2, 6, 3.6)

In [34]:
dice.describe()     # 요약 통계

count    10.000000
mean      3.600000
std       1.264911
min       2.000000
25%       3.000000
50%       3.500000
75%       4.000000
max       6.000000
dtype: float64

In [35]:
# sort_values, sort_index()

s.sort_values() #데이터 기준으로 오름차순 정렬

대구    2466052
인천    2890451
부산    3448737
서울    9904312
Name: 도시, dtype: int64

In [38]:
s.sort_values(ascending=False)   #   내림차순정렬
s.sort_values()[::-1]    #   내림차순정렬

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 도시, dtype: int64

In [39]:
s.sort_index()

대구    2466052
부산    3448737
서울    9904312
인천    2890451
Name: 도시, dtype: int64

In [46]:
# 결측치(Na,NaN,Null) 처리
dm=s-metro2
dm
dm.isnull()
dm.isnull().sum() # -> 0이 아닌 값이 나오면 결측치가 있다는 뜻  
                  # true= 1 false=0 으로 치환돼서 계산

대구     True
부산    False
서울    False
인천    False
dtype: bool

In [47]:
s.isnull() # 결측치 없음

서울    False
부산    False
인천    False
대구    False
Name: 도시, dtype: bool

In [52]:
dm.fillna(dm.mean())#결측치를 평균으로 대체
dm.fillna(dm.median())# 결측치를 중앙값으로대체
dm.fillna(0).astype(int) # 결측치를 0으로 대체하고 정수형으로 변경

대구          0
부산    3109585
서울     261998
인천     278119
dtype: int32

In [55]:
dm.dropna(inplace=True)    #결측치 제거 inplace=True ->값이 실제로 바뀜
dm

부산    3109585.0
서울     261998.0
인천     278119.0
dtype: float64

In [56]:
import seaborn as sns
titanic= sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True